Revit 2024 API
UIControlledApplication.FormulaEditing Event
 Subscribe to the FormulaEditing event to be notified when the edit formula button has been clicked.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public event EventHandler<FormulaEditingEventArgs> FormulaEditing
Visual Basic
Public Event FormulaEditing As EventHandler(Of FormulaEditingEventArgs)
Visual C++
public:
 event EventHandler<FormulaEditingEventArgs^>^ FormulaEditing {
	void add (EventHandler<FormulaEditingEventArgs^>^ value);
	void remove (EventHandler<FormulaEditingEventArgs^>^ value);
}
See Also
UIControlledApplication Class
Autodesk.Revit.UI Namespace